{
  "id": "timscdr_full_profile",
  "text": "Thakur Institute of Management Studies, Career Development & Research (TIMSCDR) was established in 2001 under the aegis of the Thakur Educational Trust of the Thakur Education Group. The institute is located at Thakur Educational Campus, Shyamnarayan Thakur Marg, Thakur Village, Kandivali (East), Mumbai - 400101, Maharashtra, India. It is an autonomous, linguistic-minority institute, approved by the All India Council for Technical Education (AICTE) and affiliated to the University of Mumbai. It is accredited with an A+ Grade by the National Assessment and Accreditation Council (NAAC) with a CGPA of 3.4. TIMSCDR aims to be a premier institute renowned internationally for providing quality education in software applications and technology aligned with global demands.\n\nCourses & Programmes: TIMSCDR offers postgraduate programmes in computer applications (Master of Computer Applications – MCA) in full-time mode. The MCA programme is affiliated with the University of Mumbai and approved by AICTE and Directorate of Technical Education (DTE), Government of Maharashtra. Eligibility for the MCA programme includes a bachelor’s degree and entrance via MAH-MCA-CET. The institute has an intake of about 120/240 seats (varies by year) for the MCA programme.\n\nFees: For the academic year 2025-26 (MCA programme) the approved total fees are approximately ₹1,60,000 (tuition + development fees) for first year, with development fee around ₹20,870. Fees are subject to revision by the Fee Regulating Authority (FRA).\n\nInfrastructure & Facilities: The campus is modern and well-equipped with facilities such as digital library, computer laboratories, WiFi-enabled campus, hostel accommodation, auditorium, seminar halls, and cafeteria. TIMSCDR focuses on overall development of students through academic, technical and soft-skills training, industry interface and placement cell.\n\nPlacements & Industry Interface: The institute’s placement cell collaborates with industry to provide training and placement opportunities to students. Recruiters include Infosys, Accenture, Capgemini, Oracle, DCB Bank, Deltecs Infotech, Metasys Software etc.\n\nContact & Address: Thakur Institute of Management Studies, Career Development & Research (TIMSCDR), Thakur Educational Campus, Shyamnarayan Thakur Marg, Thakur Village, Kandivali (East), Mumbai – 400101, Maharashtra, India. Phone: 022-2884 0484 / 91, 022-6730 8301 / 02. Email: timscdr@thakureducation.org. Website: https://www.timscdrmumbai.in\n\nNote: For up-to-date information on admissions, courses, fees, eligibility, reservation, events and club activities please check the official website or contact the admissions office directly.",
  "meta": {
    "source": "official-site-and-public-profiles",
    "scope": "institute_overview"
  }
}
