["Name: Ms. Sonu Gupta, Designation: Assistant Professor. Deputy Director & TPO, Details: Biography\nEducation\nMCA from Banasthali Vidyapith, Rajasthan\nB.Sc (Computer Science) from Jai Narain Vyas University, Jodhpur\nHonors & Awards\nWon 1st prize as a \"Best Research Paper Award\" in International Conference on Advances in Information Technology & Management (ICAIM-2017).\nWon \"Best Educational Quality Enhancement Team President Award 2007\" 2nd prize for \"Students Academic Performance\" organized by NCQM, Mumbai.\nTeaching\nCurrent Courses\nDistributed Computing and Cloud Computing\nData Structures\nDatabase Management System\nData Science\nPrevious Courses\nOperating System\nObject Oriented Programming Languages – C++\nDistributed Systems\nProject Management\nSoft Skill Development", "Name: Dr. Rajesh Kapoor, Designation: Professor, Details: Biography\nEducation\nPhD – Science Technology & Society Studies\nM Tech – Computer Science and Data Processing\nB Tech – Electronics Teaching\nPublication\nResearch\n\"Design of a Model for Accruing Social Value through Data Analytics\", paper accepted for presentation in International Conference on Business Models and Social Entrepreneurship at TISS, Mumbai on Jan 16-18, 2019\n\"A Study of The Components of State-of-The-Art Agro-Based Management Information Systems in India\", Journal of Computer Technology & Applications, Vol 9, Issue 2 Aug-18\nLogistician Dilemma: Machine Learning to the Rescue Magazine DefInsights – Sugosha Newsletter Aug 2018 Aug-18\nThe New Kid on the Block of Equipment Maintenance: Predictive Learning Magazine DefInsights – Sugosha Newsletter Sep2018 Sep 1\n\"Risk and Values: Resolving the Social Dilemmas Arising From the World Wide Web\" STS Conference Graz, Austria 07-08 May 2018, 10.3217/978-3-85125-625-3 ISBN: 978-\n\"A Stochastic Model to Enhance Information Security in Software Development through Risk Management\" International Journal of Engineering Science Invention Research & Development, Volume 4, Issue 4,  October 2017\n\"Use of the Balanced Scorecard for IT Risk Management\", ISACA Journal, Vol 5, September 2010\n\"Implementation of Service Oriented Architecture\", e-Business The ICFAI University Press, February 2006\n\"Indian ITES Industry: A Quality Perspective\" e-Business, The ICFAI University Press, August 2005", "Name: Dr. Ashwini Renavikar, Designation: Professor, Details: Biography\nEducation\nB.Sc., MCA, CSQA, PhD, Pursuing Post Doctorate\nExperience : Total 25 years of experience (Education, Research and Industry)\nSubject areas: Software Engineering and Quality Assurance, Big data analytics, AI and ML, Advanced databases, MIS\nPhD guide for Samarkand State University (Uzbekistan) and UNICAF, European University. PhD thesis evaluator and examiner for Tilak Maharashtra Vidyapeeth (Faculty of computer Science)", "Name: Dr. Padma Mishra, Designation: Associate Professor, Details: ", "Name: Dr. Sonal Sharma, Designation: Associate Professor, Details: ", "Name: Ms. Rashmi Vipat, Designation: Assistant Professor & Examination Incharge, Details: Biography\nEducation\nMCA from Rajiv Gandhi Proudyogiki Vishwavidyalaya\nB.Sc. (Electronics) from DAVV, Indore\nTeaching\nCurrent Courses\nBig Data Analytics & Visualization\nMathematical Foundation of Computer Science I\nMathematical Foundation of Computer Science II\nPrevious Courses\nAdvanced Database Techniques\nComputer Organization and Architecture\nDatabase Management System\nDecision Making & Mathematical Modeling\nDiscrete Mathematics", "Name: Mr. Shirshendu Maitra, Designation: Assistant Professor & HOD Academics, Details: Biography\nEducation\nPhD candidate\nMCA\nMBA in Fiance and system (Full Time)\nTeaching\nCurrent Courses\nImage Processing\nPrevious Courses\nData Mining", "Name: Ms. Aprajita Singh, Designation: Assistant Professor, Details: ", "Name: Ms. Rupali Jadhav, Designation: Assistant Professor & IQAC Coordinator, Details: ", "Name: Mr. Brijesh Pandey, Designation: Assistant Professor & TPO, Details: ", "Name: Ms. Kinjal Doshi, Designation: Assistant Professor, Details: ", "Name: Ms. Anamika Dhawan, Designation: Assistant Professor, Details: Biography\nEducation\nMCA from VJTI\nB.Sc(Computer Science) from Ramnarain Ruia College\nTeaching\nCurrent Courses\nDistributed System and Cloud Computing\nEthical Hacking\nPrevious Courses\nAdvanced Java Programming\nRobotic Process Automation\nDistributed System and Cloud Computing\nComputer Vision\nPython", "Name: Ms. Rohini Bagul, Designation: Assistant Professor, Details: ", "Name: Ms. Shweta Waghmare, Designation: Assistant Professor, Details: Biography\nEducation\nMCA from Veermata Jijabai Technology Institute(VJTI)\nB.Sc. (Information Technology ) from Vinayak Ganesh Vaze College, Mulund\n \n\nTeaching\nCurrent Courses\nNetworking with Linux Lab\nCyber Security and Digital Forensics\nAdvanced Java Theory\nAdvanced Web Technology\nPrevious Courses\nCore and Advanced Python\nComputer Organization and Architecture\nProgramming with JAVA\nWeb Programming", "Name: Ms. Thara Naveen, Designation: Assistant Professor, Details: ", "Name: Ms. Alifiya Shaikh, Designation: Assistant Professor, Details: ", "Name: Ms. Mira Gohil, Designation: Assistant Professor, Details: ", "Name: Dr. Shiksha Dubey, Designation: Assistant Professor, Details: Biography\nEducation\nDoctorate in Computer Application from VJTI, Mumbai\nState Level Eligibility Test (SLET) qualified in Computer Applications, Pune University\nMerit Award in 2016 for achieving 100% result in the subject taught\nTeaching\nCurrent Courses\nRobotic Process Automation\nAdvanced Web Technologies\nPrevious Courses\nCoding: Python, R, SQL, XML/XSL, LaTeX\nDatabases: SQL, SQLite\nWeb Dev: HTML, CSS\nMiscellaneous: Academic research, teaching, training, consultation, LaTeX typesetting and publishing.", "Name: Mr. Santosh Jain, Designation: Assistant Professor, Details: Biography\nEducation\nMaster in Computer Application from Mumbai University.\nBachelor in Computer Application from Tilak Maharashtra Vidyapeeth, Pune\nTeaching\nCurrent Courses\nUser Interface Lab\nAdvanced Web Technologies", "Name: Ms. Sushmitha Mary, Designation: Assistant Professor, Details: ", "Name: Ms. Rani Singh, Designation: Associate Professor of Practice, Details: ", "Name: Mr. Shubham Mishra, Designation: Assistant Professor, Details: ", "Name: Ms. Sweety Sahani, Designation: Assistant Professor, Details: Biography\nEducation\nMCA from Banasthali Vidyapith, Rajasthan\nB.Sc (Computer Science) from Jai Narain Vyas University, Jodhpur\nTeaching\nCurrent Courses\nVulnerability Assessment and Penetration Testing\nMobile Computing Lab\nAdvanced Web Technologies\nFundamental Web Technology\nWeb Technologies", "Name: Ms. Anusri M., Designation: Assistant Professor, Details: ", "Name: Ms. Kiran Dubey, Designation: Librarian, Details: "]