["ID: C01, Category: Club, Keywords: E-Cell, entrepreneurship cell, ecell, Response: E-Cell (Entrepreneurship Cell) supports student startups, organises workshops on business plan, ideation and connects students with mentors and incubators. Check TIMSCDR event pages for recent activities., Source: https://www.timscdrmumbai.in/", "ID: C02, Category: Club, Keywords: Placement Cell, placements, training, career, Response: Placement Cell coordinates industry interactions, placement drives, internships and skill-building sessions for MCA students. It works with corporate partners to improve campus placements., Source: https://tscermumbai.in/wp-content/uploads/2024/01/SSR-FINAL-MHCOGN113908-1.pdf", "ID: C03, Category: Club, Keywords: Green Club, Green IT Club, environmental club, Response: Green Club (Green IT Club) at TIMSCDR promotes sustainability on campus through awareness campaigns, tree plantation drives, and events linking technology with ecology., Source: https://www.timscdrmumbai.in/green-club/", "ID: C04, Category: Club, Keywords: Yousta club, yousta, student engagement, Response: Yousta Club promotes student-led activities and social engagement. It organises cultural events, competitions and community outreach programs., Source: https://www.timscdrmumbai.in/", "ID: C05, Category: Club, Keywords: Student Council, student body, council, Response: Student Council represents the student community, helping coordinate events, feedback, and student welfare initiatives across the institute., Source: https://tscermumbai.in/wp-content/uploads/2024/01/SSR-FINAL-MHCOGN113908-1.pdf", "ID: C06, Category: Club, Keywords: Alumni Club, alumni association, alumni, Response: Alumni Club/Association keeps former students connected with the institute, supports mentoring, and shares placement and career opportunities., Source: https://alumni.timscdrmumbai.in/about", "ID: C07, Category: Club, Keywords: Coding Club, coding, programming club, Response: Coding Club organises coding competitions, hackathons, workshops on programming languages and DSA to prepare students for technical interviews., Source: https://www.timscdrmumbai.in/", "ID: C08, Category: Club, Keywords: Sports Committee, sports, athletics, Response: Sports Committee organises intra-college and inter-college sports events, and promotes physical fitness and team spirit among students., Source: https://tscermumbai.in/wp-content/uploads/2024/01/SSR-FINAL-MHCOGN113908-1.pdf", "ID: C09, Category: Club, Keywords: Digital Club, digital, media club, Response: Digital Club focuses on digital skills such as social media, content creation, web design and digital marketing workshops for students., Source: https://www.timscdrmumbai.in/", "ID: C10, Category: Club, Keywords: Cultural Committee, cultural, arts club, Response: Cultural Committee organises festivals, cultural nights, and arts/literary activities that enrich campus life., Source: https://tscermumbai.in/wp-content/uploads/2024/01/SSR-FINAL-MHCOGN113908-1.pdf", "ID: C11, Category: Club, Keywords: NSS, national service scheme, nss, Response: NSS unit engages students in community service, social awareness drives and extension activities aligned with DLLE objectives., Source: https://www.timscdrmumbai.in/", "ID: C12, Category: Club, Keywords: Women Development Cell, wdc, women cell, Response: Women Development Cell (WDC) organises programs on gender sensitisation, safety awareness and supports women students' welfare., Source: https://tscermumbai.in/wp-content/uploads/2024/01/SSR-FINAL-MHCOGN113908-1.pdf", "ID: F01, Category: Faculty, Keywords: Rupali Jadhav, Ms Rupali Jadhav, IQAC Coordinator, Response: Ms. Rupali Jadhav — Assistant Professor & IQAC Coordinator at TIMSCDR. (Listed on TIMSCDR staff pages.) For full profile and qualifications, see the official staff listing., Source: https://www.timscdrmumbai.in/staff/", "ID: F02, Category: Faculty, Keywords: Brijesh Pandey, Mr Brijesh Pandey, assistant professor, Response: Mr. Brijesh Pandey — Assistant Professor at TIMSCDR (listed on official faculty pages). He teaches core MCA subjects and participates in student activities and training., Source: https://www.timscdrmumbai.in/staff/", "ID: F03, Category: Faculty, Keywords: Sonu Gupta, Ms Sonu Gupta, assistant professor, Response: Ms. Sonu Gupta — Assistant Professor listed in the TIMSCDR faculty list. For individual achievements and publications, check the faculty directory on the official site., Source: https://www.timscdrmumbai.in/faculty-list/", "ID: F04, Category: Faculty, Keywords: Rashmi Vipat, Ms Rashmi Vipat, Response: Ms. Rashmi Vipat — Assistant Professor (profile appears on TIMSCDR faculty listings). Faculty profiles often include qualifications and areas of research., Source: https://www.timscdrmumbai.in/faculty-list/", "ID: F05, Category: Faculty, Keywords: Aprajita Singh, Ms Aprajita Singh, Response: Ms. Aprajita Singh — Assistant Professor at TIMSCDR (listed on the college website). For details on publications and achievements, refer to the faculty page., Source: https://www.timscdrmumbai.in/faculty-list/", "ID: F06, Category: Faculty, Keywords: Shirshendu, Mr Shirshendu, assistant professor, Response: Mr. Shirshendu — Assistant Professor (name appears in faculty list). Official pages provide contact and qualification details., Source: https://www.timscdrmumbai.in/faculty-list/", "ID: F07, Category: Faculty, Keywords: Dr Vidya Nakhate, Dr. Vidya Nakhate, Response: Dr. Vidya Nakhate — Listed on Thakur group faculty pages and TIMSR listings; faculty profiles include research interests and teaching experience., Source: https://timsrmumbai.in/faculty/", "ID: F08, Category: Faculty, Keywords: Dr Rekha Singh, Dr. Rekha Singh, Response: Dr. Rekha Singh — Faculty member listed on TIMSR pages (Thakur group institutes). Check institute faculty pages for publications and awards., Source: https://timsrmumbai.in/faculty/", "ID: P01, Category: Campus, Keywords: Thakur Village, kandivali, thakur village kandivali east, Response: Thakur Educational Campus is located at Shyamnarayan Thakur Marg, Thakur Village, Kandivali (East), Mumbai — housing TIMSCDR, TCET and other Thakur institutes. Contact and address details appear on the official website., Source: https://www.timscdrmumbai.in/", "ID: P02, Category: Hostel, Keywords: Thakur Aspire, thakur aspire hostel, aspire hostel, Response: Thakur Aspire (Aspire Hostel) provides hostel accommodation close to the campus; it offers apartment-style living with facilities such as attached bathrooms, mess, security, Wi-Fi and 24x7 security — see TCET and admission hostel pages for fees and specifics., Source: https://admission.tcetmumbai.in/hostel-facility.php", "ID: P03, Category: Campus, Keywords: facilities, labs, digital library, campus facilities timscdr, Response: TIMSCDR campus has modern computer labs, a digital library, seminar halls, and industry-oriented infrastructure to support MCA practical learning., Source: https://www.timscdrmumbai.in/", "ID: H01, Category: History, Keywords: history, about timscdr, established 2001, established 2002, Response: TIMSCDR (Thakur Institute of Management Studies, Career Development & Research) was established in the early 2000s (listed as 2001/2002 in institutional profiles) as part of the Thakur Education Group to offer postgraduate and professional programs including MCA. For official history, consult the institute's About and alumni pages., Source: https://alumni.timscdrmumbai.in/about", "ID: H02, Category: Accreditation, Keywords: affiliation, mumbai university, mu, aiCTE, Response: TIMSCDR is affiliated with the University of Mumbai and follows regulations for its MCA program. It is part of the Thakur Education Campus which includes various colleges accredited and affiliated to Mumbai University., Source: https://www.timscdrmumbai.in/", "ID: A01, Category: Admission, Keywords: mca admission, mah mca cet, cap rounds, dte, Response: MCA admissions at TIMSCDR follow MAH-MCA-CET ranks and the CAP process conducted by the Directorate of Technical Education (DTE), Maharashtra., Source: https://www.shiksha.com/college/thakur-institute-of-management-studies-career-development-and-research-kandivali-east-mumbai-64243/fees", "ID: S01, Category: Syllabus, Keywords: mca syllabus, autonomous syllabus, timscdr mca syllabus, Response: The autonomous MCA syllabus at TIMSCDR covers AI, IoT, Data Analytics, Python, Cloud Computing, Software Engineering and Web Technologies — designed to be industry-oriented and practical., Source: https://www.timscdrmumbai.in/", "ID: Z01, Category: Fallback, Keywords: unknown, not trained, out of dataset, Response: I am not trained for this till now., Source: "]